; domain
(define (domain emergencias)
    (:requirements :strips :typing)
    (:types
        location box bcontent grip person dron - object
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        (free ?g - grip)
        (carrying ?d - dron ?g - grip ?b - box)
    )


    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (at-dron ?dron ?from)
        :effect (and (at-dron ?dron ?to)(not(at-dron ?dron ?from)))
    )

    (:action pick
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron)
        :precondition (and (at-dron ?dron ?location)(at-box ?box ?location)(free ?gripper))
        :effect (and (not (at-box ?box ?location))(not (free ?gripper))(carrying ?dron ?gripper ?box))
    )

    (:action leave
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location)(carrying ?dron ?gripper ?box)(at-person ?person ?location)(box-has ?box ?content))
        :effect (and (at-box ?box ?location)(free ?gripper)(not(carrying ?dron ?gripper ?box))(person-has ?person ?content)(not(box-has ?box ?content)))
    )
)

; problem
(define (problem drone_problem_d1_l33_p33_c33_g33)
(:domain emergencias)
(:objects
	dron1 - dron
	deposito refugio1 refugio2 refugio3 refugio4 refugio5 refugio6 refugio7 refugio8 refugio9 refugio10 refugio11 refugio12 refugio13 refugio14 refugio15 refugio16 refugio17 refugio18 refugio19 refugio20 refugio21 refugio22 refugio23 refugio24 refugio25 refugio26 refugio27 refugio28 refugio29 refugio30 refugio31 refugio32 refugio33 - location
	box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 box32 box33 - box
	comida medicina - bcontent
	person1 person2 person3 person4 person5 person6 person7 person8 person9 person10 person11 person12 person13 person14 person15 person16 person17 person18 person19 person20 person21 person22 person23 person24 person25 person26 person27 person28 person29 person30 person31 person32 person33 - person
	dron1-izq dron1-der - grip
)

(:init
	(at-dron dron1 deposito)
	(free dron1-izq)
	(free dron1-der)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-box box2 deposito)
	(box-has box2 comida)
	(at-box box3 deposito)
	(box-has box3 comida)
	(at-box box4 deposito)
	(box-has box4 comida)
	(at-box box5 deposito)
	(box-has box5 comida)
	(at-box box6 deposito)
	(box-has box6 comida)
	(at-box box7 deposito)
	(box-has box7 comida)
	(at-box box8 deposito)
	(box-has box8 comida)
	(at-box box9 deposito)
	(box-has box9 comida)
	(at-box box10 deposito)
	(box-has box10 comida)
	(at-box box11 deposito)
	(box-has box11 comida)
	(at-box box12 deposito)
	(box-has box12 comida)
	(at-box box13 deposito)
	(box-has box13 medicina)
	(at-box box14 deposito)
	(box-has box14 medicina)
	(at-box box15 deposito)
	(box-has box15 medicina)
	(at-box box16 deposito)
	(box-has box16 medicina)
	(at-box box17 deposito)
	(box-has box17 medicina)
	(at-box box18 deposito)
	(box-has box18 medicina)
	(at-box box19 deposito)
	(box-has box19 medicina)
	(at-box box20 deposito)
	(box-has box20 medicina)
	(at-box box21 deposito)
	(box-has box21 medicina)
	(at-box box22 deposito)
	(box-has box22 medicina)
	(at-box box23 deposito)
	(box-has box23 medicina)
	(at-box box24 deposito)
	(box-has box24 medicina)
	(at-box box25 deposito)
	(box-has box25 medicina)
	(at-box box26 deposito)
	(box-has box26 medicina)
	(at-box box27 deposito)
	(box-has box27 medicina)
	(at-box box28 deposito)
	(box-has box28 medicina)
	(at-box box29 deposito)
	(box-has box29 medicina)
	(at-box box30 deposito)
	(box-has box30 medicina)
	(at-box box31 deposito)
	(box-has box31 medicina)
	(at-box box32 deposito)
	(box-has box32 medicina)
	(at-box box33 deposito)
	(box-has box33 medicina)
	(at-person person1 refugio13)
	(at-person person2 refugio17)
	(at-person person3 refugio24)
	(at-person person4 refugio31)
	(at-person person5 refugio20)
	(at-person person6 refugio28)
	(at-person person7 refugio15)
	(at-person person8 refugio31)
	(at-person person9 refugio31)
	(at-person person10 refugio23)
	(at-person person11 refugio16)
	(at-person person12 refugio30)
	(at-person person13 refugio16)
	(at-person person14 refugio6)
	(at-person person15 refugio7)
	(at-person person16 refugio4)
	(at-person person17 refugio27)
	(at-person person18 refugio20)
	(at-person person19 refugio10)
	(at-person person20 refugio1)
	(at-person person21 refugio24)
	(at-person person22 refugio13)
	(at-person person23 refugio10)
	(at-person person24 refugio22)
	(at-person person25 refugio15)
	(at-person person26 refugio19)
	(at-person person27 refugio11)
	(at-person person28 refugio28)
	(at-person person29 refugio33)
	(at-person person30 refugio21)
	(at-person person31 refugio3)
	(at-person person32 refugio12)
	(at-person person33 refugio12)
)

(:goal (and
	(person-has person1 comida)
	(person-has person2 medicina)
	(person-has person3 medicina)
	(person-has person4 comida)
	(person-has person4 medicina)
	(person-has person6 medicina)
	(person-has person7 medicina)
	(person-has person9 comida)
	(person-has person10 medicina)
	(person-has person11 comida)
	(person-has person12 medicina)
	(person-has person13 comida)
	(person-has person13 medicina)
	(person-has person15 comida)
	(person-has person16 comida)
	(person-has person16 medicina)
	(person-has person17 comida)
	(person-has person17 medicina)
	(person-has person18 medicina)
	(person-has person19 medicina)
	(person-has person20 comida)
	(person-has person20 medicina)
	(person-has person21 comida)
	(person-has person24 medicina)
	(person-has person25 medicina)
	(person-has person26 medicina)
	(person-has person27 medicina)
	(person-has person28 medicina)
	(person-has person29 comida)
	(person-has person31 medicina)
	(person-has person32 medicina)
	(person-has person33 comida)
	(person-has person33 medicina)
))
)

; plan
1. (pick box12 deposito dron1-der dron1)
   deleted: (at-box box12 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box12)
   goals met: 0 of 33
2. (pick box33 deposito dron1-izq dron1)
   deleted: (at-box box33 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box33)
   goals met: 0 of 33
3. (move deposito refugio13 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio13)
   goals met: 0 of 33
4. (leave box12 refugio13 dron1-der dron1 person1 comida)
   deleted: (carrying dron1 dron1-der box12) (box-has box12 comida)
   added: (at-box box12 refugio13) (free dron1-der) (person-has person1 comida)
   goals met: 1 of 33
5. (move refugio13 deposito dron1)
   deleted: (at-dron dron1 refugio13)
   added: (at-dron dron1 deposito)
   goals met: 1 of 33
6. (pick box11 deposito dron1-der dron1)
   deleted: (at-box box11 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box11)
   goals met: 1 of 33
7. (move deposito refugio17 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio17)
   goals met: 1 of 33
8. (leave box33 refugio17 dron1-izq dron1 person2 medicina)
   deleted: (carrying dron1 dron1-izq box33) (box-has box33 medicina)
   added: (at-box box33 refugio17) (free dron1-izq) (person-has person2 medicina)
   goals met: 2 of 33
9. (move refugio17 deposito dron1)
   deleted: (at-dron dron1 refugio17)
   added: (at-dron dron1 deposito)
   goals met: 2 of 33
10. (pick box32 deposito dron1-izq dron1)
   deleted: (at-box box32 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box32)
   goals met: 2 of 33
11. (move deposito refugio31 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio31)
   goals met: 2 of 33
12. (move refugio31 refugio23 dron1)
   deleted: (at-dron dron1 refugio31)
   added: (at-dron dron1 refugio23)
   goals met: 2 of 33
13. (leave box32 refugio23 dron1-izq dron1 person10 medicina)
   deleted: (carrying dron1 dron1-izq box32) (box-has box32 medicina)
   added: (at-box box32 refugio23) (free dron1-izq) (person-has person10 medicina)
   goals met: 3 of 33
14. (move refugio23 deposito dron1)
   deleted: (at-dron dron1 refugio23)
   added: (at-dron dron1 deposito)
   goals met: 3 of 33
15. (pick box31 deposito dron1-izq dron1)
   deleted: (at-box box31 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box31)
   goals met: 3 of 33
16. (move deposito refugio31 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio31)
   goals met: 3 of 33
17. (move refugio31 refugio30 dron1)
   deleted: (at-dron dron1 refugio31)
   added: (at-dron dron1 refugio30)
   goals met: 3 of 33
18. (leave box31 refugio30 dron1-izq dron1 person12 medicina)
   deleted: (carrying dron1 dron1-izq box31) (box-has box31 medicina)
   added: (at-box box31 refugio30) (free dron1-izq) (person-has person12 medicina)
   goals met: 4 of 33
19. (move refugio30 deposito dron1)
   deleted: (at-dron dron1 refugio30)
   added: (at-dron dron1 deposito)
   goals met: 4 of 33
20. (pick box30 deposito dron1-izq dron1)
   deleted: (at-box box30 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box30)
   goals met: 4 of 33
21. (move deposito refugio31 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio31)
   goals met: 4 of 33
22. (move refugio31 refugio7 dron1)
   deleted: (at-dron dron1 refugio31)
   added: (at-dron dron1 refugio7)
   goals met: 4 of 33
23. (leave box11 refugio7 dron1-der dron1 person15 comida)
   deleted: (carrying dron1 dron1-der box11) (box-has box11 comida)
   added: (at-box box11 refugio7) (free dron1-der) (person-has person15 comida)
   goals met: 5 of 33
24. (move refugio7 deposito dron1)
   deleted: (at-dron dron1 refugio7)
   added: (at-dron dron1 deposito)
   goals met: 5 of 33
25. (pick box10 deposito dron1-der dron1)
   deleted: (at-box box10 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box10)
   goals met: 5 of 33
26. (move deposito refugio31 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio31)
   goals met: 5 of 33
27. (move refugio31 refugio20 dron1)
   deleted: (at-dron dron1 refugio31)
   added: (at-dron dron1 refugio20)
   goals met: 5 of 33
28. (leave box30 refugio20 dron1-izq dron1 person18 medicina)
   deleted: (carrying dron1 dron1-izq box30) (box-has box30 medicina)
   added: (at-box box30 refugio20) (free dron1-izq) (person-has person18 medicina)
   goals met: 6 of 33
29. (move refugio20 deposito dron1)
   deleted: (at-dron dron1 refugio20)
   added: (at-dron dron1 deposito)
   goals met: 6 of 33
30. (pick box29 deposito dron1-izq dron1)
   deleted: (at-box box29 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box29)
   goals met: 6 of 33
31. (move deposito refugio31 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio31)
   goals met: 6 of 33
32. (move refugio31 refugio10 dron1)
   deleted: (at-dron dron1 refugio31)
   added: (at-dron dron1 refugio10)
   goals met: 6 of 33
33. (leave box29 refugio10 dron1-izq dron1 person19 medicina)
   deleted: (carrying dron1 dron1-izq box29) (box-has box29 medicina)
   added: (at-box box29 refugio10) (free dron1-izq) (person-has person19 medicina)
   goals met: 7 of 33
34. (move refugio10 deposito dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 deposito)
   goals met: 7 of 33
35. (pick box28 deposito dron1-izq dron1)
   deleted: (at-box box28 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box28)
   goals met: 7 of 33
36. (move deposito refugio31 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio31)
   goals met: 7 of 33
37. (move refugio31 refugio22 dron1)
   deleted: (at-dron dron1 refugio31)
   added: (at-dron dron1 refugio22)
   goals met: 7 of 33
38. (leave box28 refugio22 dron1-izq dron1 person24 medicina)
   deleted: (carrying dron1 dron1-izq box28) (box-has box28 medicina)
   added: (at-box box28 refugio22) (free dron1-izq) (person-has person24 medicina)
   goals met: 8 of 33
39. (move refugio22 deposito dron1)
   deleted: (at-dron dron1 refugio22)
   added: (at-dron dron1 deposito)
   goals met: 8 of 33
40. (pick box27 deposito dron1-izq dron1)
   deleted: (at-box box27 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box27)
   goals met: 8 of 33
41. (move deposito refugio31 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio31)
   goals met: 8 of 33
42. (move refugio31 refugio19 dron1)
   deleted: (at-dron dron1 refugio31)
   added: (at-dron dron1 refugio19)
   goals met: 8 of 33
43. (leave box27 refugio19 dron1-izq dron1 person26 medicina)
   deleted: (carrying dron1 dron1-izq box27) (box-has box27 medicina)
   added: (at-box box27 refugio19) (free dron1-izq) (person-has person26 medicina)
   goals met: 9 of 33
44. (move refugio19 deposito dron1)
   deleted: (at-dron dron1 refugio19)
   added: (at-dron dron1 deposito)
   goals met: 9 of 33
45. (pick box26 deposito dron1-izq dron1)
   deleted: (at-box box26 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box26)
   goals met: 9 of 33
46. (move deposito refugio31 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio31)
   goals met: 9 of 33
47. (move refugio31 refugio11 dron1)
   deleted: (at-dron dron1 refugio31)
   added: (at-dron dron1 refugio11)
   goals met: 9 of 33
48. (leave box26 refugio11 dron1-izq dron1 person27 medicina)
   deleted: (carrying dron1 dron1-izq box26) (box-has box26 medicina)
   added: (at-box box26 refugio11) (free dron1-izq) (person-has person27 medicina)
   goals met: 10 of 33
49. (move refugio11 deposito dron1)
   deleted: (at-dron dron1 refugio11)
   added: (at-dron dron1 deposito)
   goals met: 10 of 33
50. (pick box25 deposito dron1-izq dron1)
   deleted: (at-box box25 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box25)
   goals met: 10 of 33
51. (move deposito refugio31 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio31)
   goals met: 10 of 33
52. (move refugio31 refugio33 dron1)
   deleted: (at-dron dron1 refugio31)
   added: (at-dron dron1 refugio33)
   goals met: 10 of 33
53. (leave box10 refugio33 dron1-der dron1 person29 comida)
   deleted: (carrying dron1 dron1-der box10) (box-has box10 comida)
   added: (at-box box10 refugio33) (free dron1-der) (person-has person29 comida)
   goals met: 11 of 33
54. (move refugio33 deposito dron1)
   deleted: (at-dron dron1 refugio33)
   added: (at-dron dron1 deposito)
   goals met: 11 of 33
55. (pick box9 deposito dron1-der dron1)
   deleted: (at-box box9 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box9)
   goals met: 11 of 33
56. (move deposito refugio31 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio31)
   goals met: 11 of 33
57. (move refugio31 refugio3 dron1)
   deleted: (at-dron dron1 refugio31)
   added: (at-dron dron1 refugio3)
   goals met: 11 of 33
58. (leave box25 refugio3 dron1-izq dron1 person31 medicina)
   deleted: (carrying dron1 dron1-izq box25) (box-has box25 medicina)
   added: (at-box box25 refugio3) (free dron1-izq) (person-has person31 medicina)
   goals met: 12 of 33
59. (move refugio3 deposito dron1)
   deleted: (at-dron dron1 refugio3)
   added: (at-dron dron1 deposito)
   goals met: 12 of 33
60. (pick box24 deposito dron1-izq dron1)
   deleted: (at-box box24 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box24)
   goals met: 12 of 33
61. (move deposito refugio31 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio31)
   goals met: 12 of 33
62. (leave box9 refugio31 dron1-der dron1 person4 comida)
   deleted: (carrying dron1 dron1-der box9) (box-has box9 comida)
   added: (at-box box9 refugio31) (free dron1-der) (person-has person4 comida)
   goals met: 13 of 33
63. (move refugio31 deposito dron1)
   deleted: (at-dron dron1 refugio31)
   added: (at-dron dron1 deposito)
   goals met: 13 of 33
64. (pick box8 deposito dron1-der dron1)
   deleted: (at-box box8 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box8)
   goals met: 13 of 33
65. (move deposito refugio31 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio31)
   goals met: 13 of 33
66. (leave box24 refugio31 dron1-izq dron1 person4 medicina)
   deleted: (carrying dron1 dron1-izq box24) (box-has box24 medicina)
   added: (at-box box24 refugio31) (free dron1-izq) (person-has person4 medicina)
   goals met: 14 of 33
67. (move refugio31 deposito dron1)
   deleted: (at-dron dron1 refugio31)
   added: (at-dron dron1 deposito)
   goals met: 14 of 33
68. (pick box23 deposito dron1-izq dron1)
   deleted: (at-box box23 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box23)
   goals met: 14 of 33
69. (move deposito refugio31 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio31)
   goals met: 14 of 33
70. (leave box8 refugio31 dron1-der dron1 person9 comida)
   deleted: (carrying dron1 dron1-der box8) (box-has box8 comida)
   added: (at-box box8 refugio31) (free dron1-der) (person-has person9 comida)
   goals met: 15 of 33
71. (move refugio31 deposito dron1)
   deleted: (at-dron dron1 refugio31)
   added: (at-dron dron1 deposito)
   goals met: 15 of 33
72. (pick box7 deposito dron1-der dron1)
   deleted: (at-box box7 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box7)
   goals met: 15 of 33
73. (move deposito refugio16 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio16)
   goals met: 15 of 33
74. (leave box7 refugio16 dron1-der dron1 person11 comida)
   deleted: (carrying dron1 dron1-der box7) (box-has box7 comida)
   added: (at-box box7 refugio16) (free dron1-der) (person-has person11 comida)
   goals met: 16 of 33
75. (move refugio16 deposito dron1)
   deleted: (at-dron dron1 refugio16)
   added: (at-dron dron1 deposito)
   goals met: 16 of 33
76. (pick box6 deposito dron1-der dron1)
   deleted: (at-box box6 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box6)
   goals met: 16 of 33
77. (move deposito refugio16 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio16)
   goals met: 16 of 33
78. (leave box6 refugio16 dron1-der dron1 person13 comida)
   deleted: (carrying dron1 dron1-der box6) (box-has box6 comida)
   added: (at-box box6 refugio16) (free dron1-der) (person-has person13 comida)
   goals met: 17 of 33
79. (move refugio16 deposito dron1)
   deleted: (at-dron dron1 refugio16)
   added: (at-dron dron1 deposito)
   goals met: 17 of 33
80. (pick box5 deposito dron1-der dron1)
   deleted: (at-box box5 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box5)
   goals met: 17 of 33
81. (move deposito refugio16 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio16)
   goals met: 17 of 33
82. (leave box23 refugio16 dron1-izq dron1 person13 medicina)
   deleted: (carrying dron1 dron1-izq box23) (box-has box23 medicina)
   added: (at-box box23 refugio16) (free dron1-izq) (person-has person13 medicina)
   goals met: 18 of 33
83. (move refugio16 deposito dron1)
   deleted: (at-dron dron1 refugio16)
   added: (at-dron dron1 deposito)
   goals met: 18 of 33
84. (pick box22 deposito dron1-izq dron1)
   deleted: (at-box box22 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box22)
   goals met: 18 of 33
85. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 18 of 33
86. (leave box5 refugio4 dron1-der dron1 person16 comida)
   deleted: (carrying dron1 dron1-der box5) (box-has box5 comida)
   added: (at-box box5 refugio4) (free dron1-der) (person-has person16 comida)
   goals met: 19 of 33
87. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 19 of 33
88. (pick box4 deposito dron1-der dron1)
   deleted: (at-box box4 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box4)
   goals met: 19 of 33
89. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 19 of 33
90. (leave box22 refugio4 dron1-izq dron1 person16 medicina)
   deleted: (carrying dron1 dron1-izq box22) (box-has box22 medicina)
   added: (at-box box22 refugio4) (free dron1-izq) (person-has person16 medicina)
   goals met: 20 of 33
91. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 20 of 33
92. (pick box21 deposito dron1-izq dron1)
   deleted: (at-box box21 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box21)
   goals met: 20 of 33
93. (move deposito refugio27 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio27)
   goals met: 20 of 33
94. (leave box4 refugio27 dron1-der dron1 person17 comida)
   deleted: (carrying dron1 dron1-der box4) (box-has box4 comida)
   added: (at-box box4 refugio27) (free dron1-der) (person-has person17 comida)
   goals met: 21 of 33
95. (move refugio27 deposito dron1)
   deleted: (at-dron dron1 refugio27)
   added: (at-dron dron1 deposito)
   goals met: 21 of 33
96. (pick box3 deposito dron1-der dron1)
   deleted: (at-box box3 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box3)
   goals met: 21 of 33
97. (move deposito refugio27 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio27)
   goals met: 21 of 33
98. (leave box21 refugio27 dron1-izq dron1 person17 medicina)
   deleted: (carrying dron1 dron1-izq box21) (box-has box21 medicina)
   added: (at-box box21 refugio27) (free dron1-izq) (person-has person17 medicina)
   goals met: 22 of 33
99. (move refugio27 deposito dron1)
   deleted: (at-dron dron1 refugio27)
   added: (at-dron dron1 deposito)
   goals met: 22 of 33
100. (pick box20 deposito dron1-izq dron1)
   deleted: (at-box box20 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box20)
   goals met: 22 of 33
101. (move deposito refugio1 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio1)
   goals met: 22 of 33
102. (leave box3 refugio1 dron1-der dron1 person20 comida)
   deleted: (carrying dron1 dron1-der box3) (box-has box3 comida)
   added: (at-box box3 refugio1) (free dron1-der) (person-has person20 comida)
   goals met: 23 of 33
103. (move refugio1 deposito dron1)
   deleted: (at-dron dron1 refugio1)
   added: (at-dron dron1 deposito)
   goals met: 23 of 33
104. (pick box2 deposito dron1-der dron1)
   deleted: (at-box box2 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box2)
   goals met: 23 of 33
105. (move deposito refugio1 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio1)
   goals met: 23 of 33
106. (leave box20 refugio1 dron1-izq dron1 person20 medicina)
   deleted: (carrying dron1 dron1-izq box20) (box-has box20 medicina)
   added: (at-box box20 refugio1) (free dron1-izq) (person-has person20 medicina)
   goals met: 24 of 33
107. (move refugio1 deposito dron1)
   deleted: (at-dron dron1 refugio1)
   added: (at-dron dron1 deposito)
   goals met: 24 of 33
108. (pick box19 deposito dron1-izq dron1)
   deleted: (at-box box19 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box19)
   goals met: 24 of 33
109. (move deposito refugio24 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio24)
   goals met: 24 of 33
110. (leave box19 refugio24 dron1-izq dron1 person3 medicina)
   deleted: (carrying dron1 dron1-izq box19) (box-has box19 medicina)
   added: (at-box box19 refugio24) (free dron1-izq) (person-has person3 medicina)
   goals met: 25 of 33
111. (move refugio24 deposito dron1)
   deleted: (at-dron dron1 refugio24)
   added: (at-dron dron1 deposito)
   goals met: 25 of 33
112. (pick box18 deposito dron1-izq dron1)
   deleted: (at-box box18 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box18)
   goals met: 25 of 33
113. (move deposito refugio24 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio24)
   goals met: 25 of 33
114. (leave box2 refugio24 dron1-der dron1 person21 comida)
   deleted: (carrying dron1 dron1-der box2) (box-has box2 comida)
   added: (at-box box2 refugio24) (free dron1-der) (person-has person21 comida)
   goals met: 26 of 33
115. (move refugio24 deposito dron1)
   deleted: (at-dron dron1 refugio24)
   added: (at-dron dron1 deposito)
   goals met: 26 of 33
116. (pick box1 deposito dron1-der dron1)
   deleted: (at-box box1 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box1)
   goals met: 26 of 33
117. (move deposito refugio15 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio15)
   goals met: 26 of 33
118. (move refugio15 refugio12 dron1)
   deleted: (at-dron dron1 refugio15)
   added: (at-dron dron1 refugio12)
   goals met: 26 of 33
119. (leave box1 refugio12 dron1-der dron1 person33 comida)
   deleted: (carrying dron1 dron1-der box1) (box-has box1 comida)
   added: (at-box box1 refugio12) (free dron1-der) (person-has person33 comida)
   goals met: 27 of 33
120. (leave box18 refugio12 dron1-izq dron1 person32 medicina)
   deleted: (carrying dron1 dron1-izq box18) (box-has box18 medicina)
   added: (at-box box18 refugio12) (free dron1-izq) (person-has person32 medicina)
   goals met: 28 of 33
121. (move refugio12 deposito dron1)
   deleted: (at-dron dron1 refugio12)
   added: (at-dron dron1 deposito)
   goals met: 28 of 33
122. (pick box17 deposito dron1-der dron1)
   deleted: (at-box box17 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box17)
   goals met: 28 of 33
123. (move deposito refugio15 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio15)
   goals met: 28 of 33
124. (move refugio15 refugio12 dron1)
   deleted: (at-dron dron1 refugio15)
   added: (at-dron dron1 refugio12)
   goals met: 28 of 33
125. (leave box17 refugio12 dron1-der dron1 person33 medicina)
   deleted: (carrying dron1 dron1-der box17) (box-has box17 medicina)
   added: (at-box box17 refugio12) (free dron1-der) (person-has person33 medicina)
   goals met: 29 of 33
126. (move refugio12 deposito dron1)
   deleted: (at-dron dron1 refugio12)
   added: (at-dron dron1 deposito)
   goals met: 29 of 33
127. (pick box16 deposito dron1-der dron1)
   deleted: (at-box box16 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box16)
   goals met: 29 of 33
128. (move deposito refugio15 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio15)
   goals met: 29 of 33
129. (leave box16 refugio15 dron1-der dron1 person7 medicina)
   deleted: (carrying dron1 dron1-der box16) (box-has box16 medicina)
   added: (at-box box16 refugio15) (free dron1-der) (person-has person7 medicina)
   goals met: 30 of 33
130. (move refugio15 deposito dron1)
   deleted: (at-dron dron1 refugio15)
   added: (at-dron dron1 deposito)
   goals met: 30 of 33
131. (pick box15 deposito dron1-der dron1)
   deleted: (at-box box15 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box15)
   goals met: 30 of 33
132. (move deposito refugio15 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio15)
   goals met: 30 of 33
133. (leave box15 refugio15 dron1-der dron1 person25 medicina)
   deleted: (carrying dron1 dron1-der box15) (box-has box15 medicina)
   added: (at-box box15 refugio15) (free dron1-der) (person-has person25 medicina)
   goals met: 31 of 33
134. (move refugio15 deposito dron1)
   deleted: (at-dron dron1 refugio15)
   added: (at-dron dron1 deposito)
   goals met: 31 of 33
135. (pick box14 deposito dron1-der dron1)
   deleted: (at-box box14 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box14)
   goals met: 31 of 33
136. (move deposito refugio28 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio28)
   goals met: 31 of 33
137. (leave box14 refugio28 dron1-der dron1 person6 medicina)
   deleted: (carrying dron1 dron1-der box14) (box-has box14 medicina)
   added: (at-box box14 refugio28) (free dron1-der) (person-has person6 medicina)
   goals met: 32 of 33
138. (move refugio28 deposito dron1)
   deleted: (at-dron dron1 refugio28)
   added: (at-dron dron1 deposito)
   goals met: 32 of 33
139. (pick box13 deposito dron1-der dron1)
   deleted: (at-box box13 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box13)
   goals met: 32 of 33
140. (move deposito refugio28 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio28)
   goals met: 32 of 33
141. (leave box13 refugio28 dron1-der dron1 person28 medicina)
   deleted: (carrying dron1 dron1-der box13) (box-has box13 medicina)
   added: (at-box box13 refugio28) (free dron1-der) (person-has person28 medicina)
   goals met: 33 of 33
